Tekla.Structures.AnalysisInternal.DotAnalysisDesignParameterMulti
The serialization structure for AnalysisDesignParameter.

Tekla.Structures.AnalysisInternal.DotAnalysisDesignParameterMulti.AnalysisDesignParameterBase
The analysis design parameter base object.

Tekla.Structures.AnalysisInternal.DotAnalysisDesignParameterMulti.multiValueCount
The multi value count of the analysis design parameter

Tekla.Structures.AnalysisInternal.DotAnalysisDesignParameterMulti.values
The values of the analysis design parameter

Tekla.Structures.AnalysisInternal.DotAnalysisDesignParameterMulti.ToStruct(Tekla.Structures.Analysis.AnalysisDesignParameterMulti)
DO NOT USE! For internal usage only!
analysisDesignParameterMulti:
The source analysis design parameter

Tekla.Structures.AnalysisInternal.DotAnalysisDesignParameterMulti.FromStruct(Tekla.Structures.Analysis.AnalysisDesignParameterMulti)
DO NOT USE! For internal usage only!
analysisDesignParameterMulti:
The target analysis design parameter